from django import forms

from employer.models import RequestInternModel

OPTIONS_AGES = [
    '20-24',
    '21-24',
    '22-24',
    '23-24'
]
OPTIONS_CITIES = [
    'Москва',
    'Санкт-Петербург',
    'Новосибирск',
    'Екатеринбург',
    'Нижний Новгород',
    'Казань',
    'Самара',
    'Омск',
    'Челябинск',
    'Ростов-на-Дону',
    'Уфа',
    'Волгоград',
    'Пермь',
    'Красноярск',
    'Воронеж',
    'Саратов',
    'Краснодар',
    'Тольятти',
    'Ижевск',
    'Барнаул',
    'Ульяновск',
    'Иркутск',
    'Хабаровск',
    'Ярославль',
    'Владивосток',
    'Махачкала',
    'Томск',
    'Оренбург',
    'Кемерово',
    'Новокузнецк',
    'Рязань',
    'Астрахань',
    'Пенза',
    'Липецк',
    'Тула',
    'Киров',
    'Чебоксары',
    'Курск',
    'Брянск',
    'Магнитогорск',
    'Тверь',
    'Ставрополь',
    'Сочи',
    'Белгород',
    'Владимир',
    'Нальчик',
    'Смоленск',
    'Калуга',
    'Курган'
]

OPTIONS_UNIVERSITIES = [
    'Московский государственный университет имени М.В. Ломоносова',
    'Санкт-Петербургский государственный университет',
    'Московский физико-технический институт',
    'Новосибирский государственный университет',
    'Московский институт физики и технологии',
    'Университет ИТМО',
    'Московский государственный институт международных отношений',
    'Казанский федеральный университет',
    'Уральский федеральный университет',
    'Томский государственный университет',
    'Московский государственный технический университет имени Н.Э. Баумана',
    'Санкт-Петербургский политехнический университет Петра Великого',
    'Российский университет дружбы народов',
    'Московский государственный институт электроники и математики',
    'Санкт-Петербургский государственный университет телекоммуникаций имени профессора М.А. Бонч-Бруевича',
    'Российский государственный гуманитарный университет',
    'Московский государственный университет пищевых производств',
    'Московский государственный университет технологий и управления имени К.Г. Разумовского',
    'Московский государственный институт международных отношений',
    'Московский государственный институт стали и сплавов',
    'Московский государственный технический университет имени Н.Э. Баумана',
    'Московский государственный университет геодезии и картографии',
    'Московский государственный университет экономики, статистики и информатики',
    'Московский государственный университет печати',
    'Московский государственный университет имени С.Ю. Витте',
    'Московский государственный университет имени М.И. Глинки',
    'Московский государственный университет имени М.А. Шолохова',
    'Московский государственный университет имени Л.Н. Толстого',
    'Московский государственный университет геодезии и картографии'
]

OPTIONS_DIRECTIONS = [
    'Робототехника',
    'Биотехнологии',
    'Информатика',
    'Математика',
    'Физика',
    'Химия',
    'Биология',
    'География',
    'Геология',
    'Экономика',
    'Менеджмент',
    'Маркетинг',
    'Финансы',
    'Бухгалтерский учет',
    'Аудит',
    'Юриспруденция',
    'Политология',
    'Социология',
    'Психология',
    'Философия',
    'История',
    'Культурология',
    'Иностранные языки',
    'Лингвистика',
    'Журналистика',
    'Реклама и связи с общественностью',
    'Дизайн',
    'Архитектура',
    'Строительство',
    'Гражданское строительство',
    'Механика',
    'Электротехника',
    'Электроника',
    'Телекоммуникации',
    'Автоматика и управление',
    'Металлургия',
    'Машиностроение',
    'Транспорт',
    'Автомобилестроение',
    'Авиационная техника',
    'Космическая техника',
    'Нефтегазовое дело',
    'Геодезия и картография',
    'Сельское хозяйство',
    'Ветеринария',
    'Медицина',
    'Фармация',
    'Педагогика',
    'Спорт',
    'Туризм',
    'Гостиничное дело'
]

OPTIONS_EXPERIENCE_WORK = [
    'Хакатоны',
    'Стажировки',
    'Опыт работы',
    'Волонтерство',
    'Соревнования'
]

OPTIONS_INTERNSHIP_DIRECTIONS = [
    'HR-город',
    'Городская экономика',
    'Медийный город',
    'Социальный город',
    'Комфортная городская среда',
    'Правовое пространство'
]

OPTIONS_INTERNS = [
    ('option 4', '4 Курс'),
    ('option 5', "Выпускники магистратуры")
]

OPTIONS_FIND = [
    ('option 1', 'Реклама в интернете'),
    ('option 2', "Реклама по ТВ"),
    ('option 3', "Реклама на билбордах"),
    ('option 4', "От знакомых"),
    ('option 5', "В вузе")
]


class ApplicationForInternsForm(forms.Form):
    university_course = forms.ChoiceField(choices=OPTIONS_INTERNS, widget=forms.CheckboxSelectMultiple)
    how_find = forms.ChoiceField(choices=OPTIONS_FIND, widget=forms.CheckboxSelectMultiple)
    id_tutor = forms.CharField(widget=forms.TextInput)

class RequestInternForm(forms.ModelForm):
    class Meta:
        model = RequestInternModel
        fields = "__all__"

        widgets = {
            "age": forms.TextInput(attrs={'list': 'ages', 'id': 'age', 'name': 'age', 'placeholder': '20-24', 'size': '50'}),
            "city": forms.TextInput(attrs={'list': 'cities', 'id': 'city', 'name': 'city', 'placeholder': 'Москва, Санкт-Петербург', 'size': '50'}),
            "university": forms.TextInput(attrs={'list': 'universities', 'id': 'university', 'name': 'university', 'placeholder': 'МГУ, МГТУ, СПБГУ', 'size': '50'}),
            "direction": forms.TextInput(attrs={'list': 'directions', 'id': 'direction', 'name': 'direction', 'placeholder': 'Робототехника, Биотехнологии', 'size': '50'}),
            "work_experience": forms.TextInput(attrs={'list': 'work_expirience_list', 'id': 'work_experience', 'name': 'work_experience', 'placeholder': 'Стажировки, Волонтерство, Работа', 'size': '50'}),
            "internship_direction": forms.TextInput(attrs={'list': 'internship_directions', 'id': 'internship_direction', 'name': 'internship_direction', 'placeholder': 'HR-Город, Правовое пространство', 'size': '50'}),
        }
